zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/src/converter.c
				/*
				errCode = Converter_SetSoftLimit((int32_t)msg.data.b, regulation_setting_p, (uint8_t)msg.data.a);
				if (msg.data.a & 0x80000000)	// if limit enabled
				{
					regulation_setting_p.soft_voltage_limits_enable |= ((uint8_t)msg.data.a == 0x00) ? ENABLE_LOW_LIMIT : ENABLE_HIGH_LIMIT;
				}
				else
				{
					regulation_setting_p.soft_voltage_limits_enable &= ~((uint8_t)msg.data.a == 0x00) ? ENABLE_LOW_LIMIT : ENABLE_HIGH_LIMIT;
				} */
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_SOFT_LIMIT_SETTINGS;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				
				// Apply limit settings to voltage
				regulation_setting_p->voltage.setting = CheckSetVoltageRange(regulation_setting_p->voltage.setting, 0);
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_VOLTAGE_SETTING;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				
				// Apply voltage and current settings
				apply_regulation();		
				
				if ((err_code == SLIM_MAX) || (err_code == SLIM_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else
					sound_msg = SND_CONV_SETTING_OK;
				sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
				xQueueSendToBack(xQueueSound, &sound_msg, 0);
				break;
		}
		

		
		switch(conv_state & CONV_STATE_MASK)
		{
			case CONV_OFF:
				if (msg.type == CONVERTER_SWITCH_TO_5VCH)
				{
					regulation_setting_p = &channel_5v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == CONVERTER_SWITCH_TO_12VCH)
				{
					regulation_setting_p = &channel_12v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == CONVERTER_SET_CURRENT_RANGE)
				{
					if (msg.data.a == CURRENT_RANGE_HIGH)
						regulation_setting_p->current = &regulation_setting_p->current_high_range;
					else
						regulation_setting_p->current = &regulation_setting_p->current_low_range;
					
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_CURRENT_LIMIT;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}

				if (msg.type == CONVERTER_TURN_OFF)
				{
					conv_state = CONV_OFF;			// Reset overload flag
					break;
				}
				if (msg.type == CONVERTER_TURN_ON)
				{
					// Message to turn on converter is received
					if ((state_HWProcess & STATE_HW_TIMER_NOT_EXPIRED) || (!(state_HWProcess & STATE_HW_USER_TIMER_EXPIRED)))
					{
						// Safe timeout is not expired
						break;
					}
					ctrl_HWProcess = CMD_HW_ON;
					while(ctrl_HWProcess);
					conv_state = CONV_ON;			// Switch to new state and reset overload flag
					break;
				}
				break;
			case CONV_ON:
				if (msg.type == CONVERTER_TURN_OFF)
				{
					conv_state = disableConverterAndCheckHWState();
					break;
				}
				if ( (msg.type == CONVERTER_SWITCH_TO_5VCH) && (regulation_setting_p != &channel_5v) )
				{
					conv_state = disableConverterAndCheckHWState();
					vTaskDelay(4);
					regulation_setting_p = &channel_5v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if ( (msg.type == CONVERTER_SWITCH_TO_12VCH) && (regulation_setting_p != &channel_12v) )
				{
					conv_state = disableConverterAndCheckHWState();
					vTaskDelay(4);
					regulation_setting_p = &channel_12v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (state_HWProcess & STATE_HW_OFF)
				{
					// Some hardware error has happened and converter had been switched off
					conv_state = CONV_OFF;
					conv_state |= analyzeAndResetHWErrorState();
					if (conv_state & CONV_OVERLOAD)
					{
						// Send message to sound driver
						// TODO: send this message in other cases (when overload is detected simultaneously with button)
						sound_msg = SND_CONV_OVERLOADED | SND_CONVERTER_PRIORITY_HIGHEST;
						xQueueSendToBack(xQueueSound, &sound_msg, 0);
					}
					break;
				}
				break;
		}
		
		
		// Will be special for charging mode - TODO
		if (msg.type == CONVERTER_TICK)
		{
			// ADC task is responsible for sampling and filtering voltage and current
			adc_msg = ADC_GET_ALL_NORMAL;
			xQueueSendToBack(xQueueADC, &adc_msg, 0);
		}			
		
		// Apply controls
		__disable_irq();
		SetFeedbackChannel(regulation_setting_p->CHANNEL);		// PORTF can be accessed from ISR
		__enable_irq();
		SetCurrentRange(regulation_setting_p->current->RANGE);
		SetOutputLoad(channel_12v.load_state);
	
		// Always make sure settings are within allowed range
		regulation_setting_p->current->setting = CheckSetCurrentRange((int32_t)regulation_setting_p->current->setting, &err_code);
		regulation_setting_p->voltage.setting = CheckSetVoltageRange((int32_t)regulation_setting_p->voltage.setting, &err_code);

		// Apply voltage and current settings
		apply_regulation();		
		
	
		// LED indication

	}
	
}




//=================================================================//
//=================================================================//
//=================================================================//
//=================================================================//




